# Напишите программу, которая принимает на вход вещественное число, и показывает сумму его цифр
n = int(input())
array = [0 for i in range(n)]
print(array)